USE test;

DROP TABLE IF EXISTS Book;

CREATE TABLE Book (
  ID INT NOT NULL AUTO_INCREMENT,
  title VARCHAR(100) NOT NULL,
  description VARCHAR(255),
  author VARCHAR(100) NOT NULL,
  isbn VARCHAR(20),
  printYear INT NOT NULL,
  readAlready BIT NOT NULL,
  PRIMARY KEY (ID))
  COLLATE='utf8_general_ci';

INSERT INTO Book (title, description, author, isbn, printYear, readAlready)
    VALUES
      ("Война и Мир", "Про войну и мир", "Толстой Л.Н.", "1234", 1867, 0),
      ("Анна каренина", "Про Анну Каренину", "Толстой Л.Н.",  "4321", 1877, 1),
      ("Капитанская дочка", "Про капитанскую дочь", "Пушкин А.С.",  "2341", 1836, 0),
      ("Дубровский", "Про Дубровского", "Пушкин А.С.",  "7689", 1841, 1),
      ("Герой нашего времени", "Про героя нашего времени", "Лермонтов М.Ю.",  "7896", 1840, 1),
      ("Мцыри", "Про мцыри", "Лермонтов М.Ю.",  "1111", 1840, 1),
      ("Демон", "Про демона", "Лермонтов М.Ю.",  "4526", 1842, 1),
      ("Мёртвые души", "Про мёртвые души", "Гоголь Н.В.",  "3424", 1842, 1),
      ("Тарас Бульба", "Про Тараса Бульбу", "Гоголь Н.В.",  "7800", 1835, 1),
      ("Шинель", "Про шинель", "Гоголь Н.В.",  "3452", 1842, 1),
      ("Нос", "Про нос", "Гоголь Н.В.",  "5555", 1836, 1),
      ("Вечера на хуторе близ диканьки", "Про вечера на хуторе близ диканьки", "Гоголь Н.В.",  "7474", 1832, 1),
      ("Портрет", "Про портрет", "Гоголь Н.В.",  "0000", 1835, 1),
      ("Пари", "Про пари", "Чехов А.П.",  "5555", 1889, 1),
      ("Дуэль", "Про дуэль", "Чехов А.П.",  "5432", 1891, 0),
      ("Дама с собачкой", "Про даму с собачкой", "Чехов А.П.",  "4444", 1899, 1),
      ("Идиот", "Про идиота", "Достоевский Ф.М.",  "4653", 1869, 1),
      ("Бородино", "Про Бородино", "Лермонтов М.Ю.",  "9809", 1837, 1),
      ("Братья Карамазовы", "Про братьев Карамазовых", "Достоевский Ф.М.",  "0963", 1880, 1),
      ("Бесы", "Про бесов", "Достоевский Ф.М.",  "3432", 1872, 1),
      ("Преступление и наказание", "Про преступление и наказание", "Достоевский Ф.М.",  "8753", 1866, 0);